src/Catalogs/РолиОборудования/РолиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиОборудования</name>
  <predefined>
    <items>
      <name>Apache</name>
      <description>Apache</description>
    </items>
    <items>
      <name>СерверIIS</name>
      <description>IIS</description>
    </items>
    <items>
      <name>СерверMSSQL</name>
      <description>MS SQL</description>
    </items>
    <items>
      <name>СерверPostgreSQL</name>
      <description>PostgreSQL</description>
    </items>
    <items>
      <name>ВиртуальнаяМашинаVMware</name>
      <description>Виртуальная машина VMware</description>
    </items>
    <items>
      <name>ВнешнийРесурс</name>
      <description>Внешний ресурс</description>
    </items>
    <items>
      <name>РабочийСервер1С</name>
      <description>Рабочий сервер 1С</description>
    </items>
    <items>
      <name>Сервер1СиMSSQL</name>
      <description>Сервер &quot;1С и MS SQL&quot;</description>
    </items>
    <items>
      <name>Сервер1СиPostgreSQL</name>
      <description>Сервер &quot;1С и PostgreSQL&quot;</description>
    </items>
    <items>
      <name>Сервер1СПредприятие</name>
      <description>Сервер &quot;1С:Предприятие&quot;</description>
    </items>
    <items>
      <name>СерверWindows</name>
      <description>Сервер c ОС Windows</description>
    </items>
    <items>
      <name>СерверLinux</name>
      <description>Сервер с ОС Linux</description>
    </items>
    <items>
      <name>ТерминальныйСервер</name>
      <description>Терминальный сервер</description>
    </items>
    <items>
      <name>Шлюз</name>
      <description>Шлюз</description>
    </items>
  </predefined>
  <attributes>
    <name>УдалитьСоздаватьКонтрольныеПроцедуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиLinux</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СчетчикПроизводительностиПрименимо/СчетчикПроизводительностиПрименимо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СчетчикПроизводительностиПрименимо</name>
  <enumValues>
    <name>WindowsLinux</name>
  </enumValues>
  <enumValues>
    <name>Windows</name>
  </enumValues>
  <enumValues>
    <name>Linux</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архитектура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияИнформацииОСистеме</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнегоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МакАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистемаВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписи</name>
    <comment>Период записи данных в регистр сведений &quot;Текущие значения производительности&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьДоступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеПроизводительности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОС</name>
    <type>
      <types>EnumRef.ТипОС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРоль</name>
    <type>
      <types>CatalogRef.РолиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСчетчикПоНаименованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеЛицензий1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияRing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаUTCОбновленияЛицензий1С</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СобиратьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Зафиксировать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиОборудования</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиРолей</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/РолиОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Объект.Ссылка.Предопределенный Тогда
		ЭтотОбъект.Элементы.СчетчикиПроизводительностиЗаполнитьПоШаблону.Видимость = Истина;
		ЭтотОбъект.Элементы.Наименование.РедактированиеТекста = Ложь;
    КонецЕсли;
    
    ОборудованиеМассив = ПолучитьОборудование(Объект.Ссылка);
    ОбновитьТаблицуОборудования(ОборудованиеМассив, ЭтотОбъект.Оборудование);
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
    
    Объект.СчетчикиПроизводительности.Очистить();
    Объект.СчетчикиПроизводительностиLinux.Очистить();
	
	Счетчики = ПолучитьСчетчикиПоШаблонуНаСервере(Объект.Ссылка);
    
	Для Каждого ТекСчетчик Из Счетчики.Windows Цикл
		НовСтрока = Объект.СчетчикиПроизводительности.Добавить();
		НовСтрока.СчетчикПроизводительности = ТекСчетчик;
    КонецЦикла;
    
    Для Каждого ТекСчетчик Из Счетчики.Linux Цикл
		НовСтрока = Объект.СчетчикиПроизводительностиLinux.Добавить();
		НовСтрока.СчетчикПроизводительности = ТекСчетчик;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОборудование(Команда)
    
    ОборудованиеМассив = ПолучитьОборудование(Объект.Ссылка);
    ОбновитьТаблицуОборудования(ОборудованиеМассив, ЭтотОбъект.Оборудование);
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсем(Команда)
    
    Для Каждого ТекСтрока Из ЭтотОбъект.Оборудование Цикл
        ТекСтрока.Применить = Истина;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсем(Команда)
    
    Для Каждого ТекСтрока Из ЭтотОбъект.Оборудование Цикл
        ТекСтрока.Применить = Ложь;
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетчики(Команда)
    
    Если Модифицированность Тогда
        ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСчетчикиВопрос", ЭтотОбъект);
        ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Для синхронизации необходимо записать изменения. Записать и продолжить?'"), РежимДиалогаВопрос.ДаНетОтмена);
    Иначе
        УстановитьСчетчикиОбщая();
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Поле.Имя = "ОборудованиеОборудование" Тогда
        ПараметрыОткрытия = Новый Структура("Ключ", Элемент.ТекущиеДанные.Оборудование);
        ОткрытьФорму("Справочник.Оборудование.Форма.ФормаЭлемента", ПараметрыОткрытия);
        СтандартнаяОбработка = Ложь;
    КонецЕсли;
    
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСчетчикиПоШаблонуНаСервере(Ссылка)
    
    Счетчики = Новый Структура("Windows, Linux", Новый Массив, Новый Массив);
    
    Если Ссылка = Справочники.РолиОборудования.СерверWindows Тогда
        Счетчики.Windows = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Windows);
    ИначеЕсли Ссылка = Справочники.РолиОборудования.СерверLinux Тогда
        Счетчики.Linux = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Linux);
    ИначеЕсли Ссылка = Справочники.РолиОборудования.СерверMSSQL Тогда
        Счетчики.Windows = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Windows);
    КонецЕсли;
            
	Возврат Счетчики;
    
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОборудование(РольОборудования)
    Возврат Справочники.РолиОборудования.ПолучитьОборудование(РольОборудования);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТаблицуОборудования(МассивСсылок, Оборудование)
    
    Оборудование.Очистить();
    Для Каждого ТекСсылка Из МассивСсылок Цикл
        НовСтрока = Оборудование.Добавить();
        НовСтрока.Применить = Истина;
        НовСтрока.Оборудование = ТекСсылка;
    КонецЦикла;
        
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СинхронизироватьСчетчики(Роль, Оборудование, Счетчики)
    
    Для Каждого ТекОборудование Из Оборудование Цикл
        Справочники.Оборудование.СинхронизироватьСчетчикиПроизводительности(Роль, ТекОборудование, Счетчики);
    КонецЦикла;
        
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетчикиВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ЭтотОбъект.Записать();
        УстановитьСчетчикиОбщая();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетчикиОбщая()
    
    ОборудованиеМассив = Новый Массив;
    Для Каждого ТекСтрока Из ЭтотОбъект.Оборудование Цикл
        Если ТекСтрока.Применить Тогда
            ОборудованиеМассив.Добавить(ТекСтрока.Оборудование);
        КонецЕсли;
    КонецЦикла;
    
    СчетчикиПроизводительностиМассив = Новый Массив;
    Для Каждого ТекСтрока Из Объект.СчетчикиПроизводительности Цикл
        СчетчикиПроизводительностиМассив.Добавить(ТекСтрока.СчетчикПроизводительности);
    КонецЦикла;
    
    СинхронизироватьСчетчики(Объект.Ссылка, ОборудованиеМассив, СчетчикиПроизводительностиМассив);
    
КонецПроцедуры

#КонецОбласти
